// Улица: развилка на три финальные ветки
addScenes(1, {
    street_crossroad: {
        bgm: 'audio/chill.mp3',
        loc: 'Улица Пангод (Перепутье)',
        image: 'img/street.jpg',
        checkpoint: true,
        text: [
            "На улице просто адски, невыносимо морозно. Суровая, беспощадная северная зима в Пангодах не щадит абсолютно никого, пробирая ледяным, колючим ветром до самых костей и замораживая сопли прямо в носу за пару секунд. Саша неловко поправляет свои очки, которые моментально, сплошной белой пеленой покрылись толстым слоем непроглядного конденсата от перепада температур.",
            "<span class='heart-tag'>💓 Прогулка:</span> Вы идете рядом по заснеженному тротуару, и Саша специально переходит на наветренную сторону, чтобы закрывать тебя от колючей северной поземки своим плечом. Ваши руки в карманах курток постоянно случайно сталкиваются при ходьбе, но почему-то ни ты, ни он не пытаетесь отойти подальше.",
            "<span class='name-tag'>Саша:</span> «Слушай, Анжел... У меня батя опять уехал на вахту. Снова на 2 долгих, ебаных месяца будет торчать там, на севере, машины чинить, а по вечерам на кухне бухать и шортсы на Ютубе залипать. Так что его гараж теперь полностью в моем распоряжении, ключи у меня в кармане. Я туда недавно притащил старую светодиодную ленту, нашел полунерабочую возле мусорки — сам спаял контакты, теперь она офигенно светит. А еще у меня там заначена бутылка зеленого абсента. Пойдем вдвоем, посидим в тепле, пофилософствуем о вечном? Ну... если ты, конечно, не против моей компании.»",
            "Он говорит это с непривычной для него неуверенностью, ковыряя носком ботинка сугроб и явно очень надеясь, что ты согласишься пойти именно с ним. Предложение звучит невероятно соблазнительно. С другой стороны, тебе ровно через час кровь из носу нужно быть на занятии в ДК по электрогитаре, где дежурит маразматичный дед-ОБЖшник.",
            "А еще есть третий вариант: сегодня Вова (легендарный Вавандряус) обещал принести к Рамазану на Базу ту самую эпичную настольную игру за бешеные 15 000 рублей.",
            "Перед тобой лежит выбор, который определит остаток этого безумного дня."
        ],
        choices: [
            { text: "Пойти вдвоем с Сашей в гараж (Абсент, гирлянды и разговоры по душам) ❤️", next: 'garage_scene' },
            { text: "Пойти в ДК на урок гитары (Долг зовет)", next: 'dk_scene' },
            { text: "Позвать Сашу с собой на Базу Рамазана к Вове (Настолка за 15к) 🎲", next: 'call_vova' }
        ]
    },
});
